#pragma once

#include <devioctl.h>

#define VMICRO_PROTOCOL_MAGIC 0x314D4356UL
#define VMICRO_PROTOCOL_VERSION 1U
#define VMICRO_REPORT_LENGTH 64U
#define VMICRO_MAX_BATCH_REPORTS 64U
#define VMICRO_KEYBOARD_REPORT_ID 0x07U
#define VMICRO_KEYBOARD_KEY_ENTER 0x28U
#define VMICRO_KEYBOARD_KEY_TAB 0x2BU
#define VMICRO_KEYBOARD_MODIFIER_LEFT_SHIFT 0x02U

#define VMICRO_INFO_FLAG_READY 0x00000001UL
#define VMICRO_INFO_FLAG_DIALOG_KEYBOARD 0x00000002UL

#define IOCTL_VMICRO_GET_INFO \
    CTL_CODE(FILE_DEVICE_UNKNOWN, 0x800, METHOD_BUFFERED, FILE_READ_DATA | FILE_WRITE_DATA)
#define IOCTL_VMICRO_SUBMIT_INPUT \
    CTL_CODE(FILE_DEVICE_UNKNOWN, 0x801, METHOD_BUFFERED, FILE_READ_DATA | FILE_WRITE_DATA)
#define IOCTL_VMICRO_READ_OUTPUT \
    CTL_CODE(FILE_DEVICE_UNKNOWN, 0x802, METHOD_BUFFERED, FILE_READ_DATA | FILE_WRITE_DATA)
#define IOCTL_VMICRO_SUBMIT_KEYBOARD \
    CTL_CODE(FILE_DEVICE_UNKNOWN, 0x803, METHOD_BUFFERED, FILE_READ_DATA | FILE_WRITE_DATA)

// {E2A7CB54-8420-4D51-9DD8-D6575B9251D1}
EXTERN_C const GUID GUID_DEVINTERFACE_CODEX_MICRO_VHF;

#pragma pack(push, 1)

typedef struct _VMICRO_INFO {
    ULONG Magic;
    USHORT Version;
    USHORT Size;
    UINT64 ConnectionEpoch;
    UINT64 LastBatchSequence;
    UINT64 OutputSequence;
    ULONG DroppedOutputReports;
    ULONG Flags;
} VMICRO_INFO, *PVMICRO_INFO;

typedef struct _VMICRO_BATCH_HEADER {
    ULONG Magic;
    USHORT Version;
    USHORT ReportCount;
    UINT64 Sequence;
} VMICRO_BATCH_HEADER, *PVMICRO_BATCH_HEADER;

typedef enum _VMICRO_SUBMIT_DISPOSITION {
    VmicroSubmitNotSent = 0,
    VmicroSubmitAccepted = 1,
    VmicroSubmitOutcomeUnknown = 2,
    VmicroSubmitDuplicate = 3,
    VmicroSubmitRejected = 4,
} VMICRO_SUBMIT_DISPOSITION;

typedef struct _VMICRO_SUBMIT_RESULT {
    ULONG Magic;
    USHORT Version;
    USHORT Size;
    UINT64 Sequence;
    ULONG Disposition;
    ULONG AcceptedReports;
    LONG FirstFailureStatus;
    ULONG Reserved;
} VMICRO_SUBMIT_RESULT, *PVMICRO_SUBMIT_RESULT;

typedef struct _VMICRO_KEYBOARD_INPUT {
    ULONG Magic;
    USHORT Version;
    USHORT Size;
    UINT64 Sequence;
    UCHAR KeyCode;
    UCHAR Modifiers;
    UCHAR Reserved[6];
} VMICRO_KEYBOARD_INPUT, *PVMICRO_KEYBOARD_INPUT;

#define VMICRO_OUTPUT_FLAG_BUFFER_INCLUDED_REPORT_ID 0x00000001UL
#define VMICRO_OUTPUT_FLAG_BUFFER_EXCLUDED_REPORT_ID 0x00000002UL

typedef struct _VMICRO_OUTPUT_RECORD {
    ULONG Magic;
    USHORT Version;
    USHORT Size;
    UINT64 Sequence;
    UINT64 PerformanceCounter;
    ULONG OriginalLength;
    ULONG Flags;
    UCHAR WireReport[VMICRO_REPORT_LENGTH];
} VMICRO_OUTPUT_RECORD, *PVMICRO_OUTPUT_RECORD;

#pragma pack(pop)

C_ASSERT(sizeof(VMICRO_INFO) == 40);
C_ASSERT(sizeof(VMICRO_BATCH_HEADER) == 16);
C_ASSERT(sizeof(VMICRO_SUBMIT_RESULT) == 32);
C_ASSERT(sizeof(VMICRO_KEYBOARD_INPUT) == 24);
C_ASSERT(sizeof(VMICRO_OUTPUT_RECORD) == 96);
